-----------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  [REDACTED SERVER]\telesafe_safety_netting_results.log
  log type:  text
 opened on:  28 Sep 2025, 13:53:45

. 
. asdoc, text(Telesafe Results) fs(15) save(telesafe_results_cons_level) replace
(file telesafe_results_cons_level.doc not found)
Click to Open File:  telesafe_results_cons_level.doc

. 
. ** cons level
. 
. use one_line_per_cons.dta, clear

. 
. *table 1
. asdoc tab pt_age_cat if pt_dup!=1, missing
(File telesafe_results_cons_level.doc already exists, option append was assumed)

   __000000 |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-34 |          9        9.68        9.68
      35-49 |          9        9.68       19.35
      50-64 |         21       22.58       41.94
       >=65 |         53       56.99       98.92
          . |          1        1.08      100.00
------------+-----------------------------------
      Total |         93      100.00
Click to Open File:  telesafe_results_cons_level.doc

. asdoc tab gender if pt_dup!=1, missing
(File telesafe_results_cons_level.doc already exists, option append was assumed)

           Gender |      Freq.     Percent        Cum.
------------------+-----------------------------------
             Male |         32       34.41       34.41
           Female |         58       62.37       96.77
                . |          3        3.23      100.00
------------------+-----------------------------------
            Total |         93      100.00
Click to Open File:  telesafe_results_cons_level.doc

. asdoc tab ethnicity if pt_dup!=1, missing
(File telesafe_results_cons_level.doc already exists, option append was assumed)

        Ethnicity |      Freq.     Percent        Cum.
------------------+-----------------------------------
            Black |          1        1.08        1.08
            Mixed |          2        2.15        3.23
            White |         87       93.55       96.77
Prefer not to say |          1        1.08       97.85
                . |          2        2.15      100.00
------------------+-----------------------------------
            Total |         93      100.00
Click to Open File:  telesafe_results_cons_level.doc

. asdoc tab no_of_probs, missing
(File telesafe_results_cons_level.doc already exists, option append was assumed)

no_of_probs |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         53       55.21       55.21
          2 |         22       22.92       78.12
          3 |         17       17.71       95.83
          4 |          2        2.08       97.92
          5 |          2        2.08      100.00
------------+-----------------------------------
      Total |         96      100.00
Click to Open File:  telesafe_results_cons_level.doc

. asdoc tab practice_dep, missing
(File telesafe_results_cons_level.doc already exists, option append was assumed)

practice_de |
          p |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         20       20.83       20.83
          2 |          7        7.29       28.12
          5 |          6        6.25       34.38
          9 |         42       43.75       78.12
         10 |         21       21.88      100.00
------------+-----------------------------------
      Total |         96      100.00
Click to Open File:  telesafe_results_cons_level.doc

. asdoc tab practice_, missing nolab
(File telesafe_results_cons_level.doc already exists, option append was assumed)

   practice |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          5        5.21        5.21
          2 |         42       43.75       48.96
          3 |          1        1.04       50.00
          4 |         21       21.88       71.88
          5 |          7        7.29       79.17
          6 |         15       15.62       94.79
          7 |          5        5.21      100.00
------------+-----------------------------------
      Total |         96      100.00
Click to Open File:  telesafe_results_cons_level.doc

. asdoc tab hcp_role
(File telesafe_results_cons_level.doc already exists, option append was assumed)

  Healthcare professional |
                     role |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
A partner in your surgery |         86       89.58       89.58
            A salaried GP |          9        9.38       98.96
             GP Registrar |          1        1.04      100.00
--------------------------+-----------------------------------
                    Total |         96      100.00
(file telesafe_results_cons_level.doc not found)
file telesafe_results_cons_level.doc could not be opened
                 fopen():   603  file could not be opened
      asdoc_tab_onevar():     -  function returned error
                 <istmt>:     -  function returned error
r(603);

end of do-file

r(603);

. do "[REDACTED SERVER]\STD1cf0_000004.tmp"

. asdoc tab hcp_role
(File telesafe_results_cons_level.doc already exists, option append was assumed)

  Healthcare professional |
                     role |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
A partner in your surgery |         86       89.58       89.58
            A salaried GP |          9        9.38       98.96
             GP Registrar |          1        1.04      100.00
--------------------------+-----------------------------------
                    Total |         96      100.00
Click to Open File:  telesafe_results_cons_level.doc

. 
. tab gp_id2, matcell(gp_cons_freq)

      gp_id |      Freq.     Percent        Cum.
------------+-----------------------------------
       GP 1 |         18       18.75       18.75
       GP 2 |          1        1.04       19.79
       GP 3 |          1        1.04       20.83
       GP 4 |          6        6.25       27.08
       GP 5 |          3        3.12       30.21
       GP 6 |          1        1.04       31.25
       GP 7 |          1        1.04       32.29
       GP 8 |         20       20.83       53.12
       GP 9 |          3        3.12       56.25
      GP 10 |          2        2.08       58.33
      GP 11 |          9        9.38       67.71
      GP 12 |          2        2.08       69.79
      GP 13 |          1        1.04       70.83
      GP 14 |          5        5.21       76.04
      GP 15 |          1        1.04       77.08
      GP 16 |          5        5.21       82.29
      GP 17 |          4        4.17       86.46
      GP 18 |         11       11.46       97.92
      GP 19 |          1        1.04       98.96
      GP 20 |          1        1.04      100.00
------------+-----------------------------------
      Total |         96      100.00

. svmat gp_cons_freq, name(gp_cons_freq)

. asdoc tabstat gp_cons_freq, stat(mean median sd min max range) 
(File telesafe_results_cons_level.doc already exists, option append was assumed)

             |      Mean        p50         SD        Min        Max      Range 
-------------+-----------------------------------------------------------------
gp_cons_fr~1 |       4.8        2.5   5.625132          1         20         19 
Click to Open File:  telesafe_results_cons_level.doc

. 
. tab  gp_id2 any_sna_cons, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |     any_sna_cons
     gp_id |         0          1 |     Total
-----------+----------------------+----------
      GP 1 |        12          6 |        18 
           |     66.67      33.33 |    100.00 
-----------+----------------------+----------
      GP 2 |         0          1 |         1 
           |      0.00     100.00 |    100.00 
-----------+----------------------+----------
      GP 3 |         0          1 |         1 
           |      0.00     100.00 |    100.00 
-----------+----------------------+----------
      GP 4 |         2          4 |         6 
           |     33.33      66.67 |    100.00 
-----------+----------------------+----------
      GP 5 |         2          1 |         3 
           |     66.67      33.33 |    100.00 
-----------+----------------------+----------
      GP 6 |         1          0 |         1 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
      GP 7 |         0          1 |         1 
           |      0.00     100.00 |    100.00 
-----------+----------------------+----------
      GP 8 |         7         13 |        20 
           |     35.00      65.00 |    100.00 
-----------+----------------------+----------
      GP 9 |         2          1 |         3 
           |     66.67      33.33 |    100.00 
-----------+----------------------+----------
     GP 10 |         0          2 |         2 
           |      0.00     100.00 |    100.00 
-----------+----------------------+----------
     GP 11 |         3          6 |         9 
           |     33.33      66.67 |    100.00 
-----------+----------------------+----------
     GP 12 |         0          2 |         2 
           |      0.00     100.00 |    100.00 
-----------+----------------------+----------
     GP 13 |         0          1 |         1 
           |      0.00     100.00 |    100.00 
-----------+----------------------+----------
     GP 14 |         3          2 |         5 
           |     60.00      40.00 |    100.00 
-----------+----------------------+----------
     GP 15 |         0          1 |         1 
           |      0.00     100.00 |    100.00 
-----------+----------------------+----------
     GP 16 |         2          3 |         5 
           |     40.00      60.00 |    100.00 
-----------+----------------------+----------
     GP 17 |         0          4 |         4 
           |      0.00     100.00 |    100.00 
-----------+----------------------+----------
     GP 18 |         3          8 |        11 
           |     27.27      72.73 |    100.00 
-----------+----------------------+----------
     GP 19 |         1          0 |         1 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
     GP 20 |         0          1 |         1 
           |      0.00     100.00 |    100.00 
-----------+----------------------+----------
     Total |        38         58 |        96 
           |     39.58      60.42 |    100.00 

. duplicates tag gp_id2, gen(gp_duplicate_count)

Duplicates in terms of gp_id2

. tab  gp_id2 any_sna_cons if gp_duplicate_count >3, row 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |     any_sna_cons
     gp_id |         0          1 |     Total
-----------+----------------------+----------
      GP 1 |        12          6 |        18 
           |     66.67      33.33 |    100.00 
-----------+----------------------+----------
      GP 4 |         2          4 |         6 
           |     33.33      66.67 |    100.00 
-----------+----------------------+----------
      GP 8 |         7         13 |        20 
           |     35.00      65.00 |    100.00 
-----------+----------------------+----------
     GP 11 |         3          6 |         9 
           |     33.33      66.67 |    100.00 
-----------+----------------------+----------
     GP 14 |         3          2 |         5 
           |     60.00      40.00 |    100.00 
-----------+----------------------+----------
     GP 16 |         2          3 |         5 
           |     40.00      60.00 |    100.00 
-----------+----------------------+----------
     GP 18 |         3          8 |        11 
           |     27.27      72.73 |    100.00 
-----------+----------------------+----------
     Total |        32         42 |        74 
           |     43.24      56.76 |    100.00 

. tab  gp_id2 hcp_verbal_sna if gp_duplicate_count >3, row 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |       Frequency of verbal
           |      safety-netting advice
     gp_id | Sometimes  Often (50  Most of t |     Total
-----------+---------------------------------+----------
      GP 1 |         0         18          0 |        18 
           |      0.00     100.00       0.00 |    100.00 
-----------+---------------------------------+----------
      GP 4 |         0          6          0 |         6 
           |      0.00     100.00       0.00 |    100.00 
-----------+---------------------------------+----------
      GP 8 |         0         20          0 |        20 
           |      0.00     100.00       0.00 |    100.00 
-----------+---------------------------------+----------
     GP 11 |         0          9          0 |         9 
           |      0.00     100.00       0.00 |    100.00 
-----------+---------------------------------+----------
     GP 14 |         0          5          0 |         5 
           |      0.00     100.00       0.00 |    100.00 
-----------+---------------------------------+----------
     GP 16 |         0          0          5 |         5 
           |      0.00       0.00     100.00 |    100.00 
-----------+---------------------------------+----------
     GP 18 |        11          0          0 |        11 
           |    100.00       0.00       0.00 |    100.00 
-----------+---------------------------------+----------
     Total |        11         58          5 |        74 
           |     14.86      78.38       6.76 |    100.00 

. 
. *Results demographics
. asdoc tabstat pt_age, stat(mean median sd min max range) if pt_dup!=1
(File telesafe_results_cons_level.doc already exists, option append was assumed)

             |      Mean        p50         SD        Min        Max      Range 
-------------+-----------------------------------------------------------------
      pt_age |  63.65263         69    16.3595         18         94         76 
Click to Open File:  telesafe_results_cons_level.doc

. asdoc tabstat no_of_probs, stat(mean median sd min max range) 
(File telesafe_results_cons_level.doc already exists, option append was assumed)

             |      Mean        p50         SD        Min        Max      Range 
-------------+-----------------------------------------------------------------
 no_of_probs |  1.729167          1   .9676794          1          5          4 
Click to Open File:  telesafe_results_cons_level.doc

. 
. asdoc tab any_sna_cons
(File telesafe_results_cons_level.doc already exists, option append was assumed)

any_sna_con |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         38       39.58       39.58
          1 |         58       60.42      100.00
------------+-----------------------------------
      Total |         96      100.00
Click to Open File:  telesafe_results_cons_level.doc

. asdoc tab any_fu_cons
(File telesafe_results_cons_level.doc already exists, option append was assumed)

any_fu_cons |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         22       22.92       22.92
          1 |         74       77.08      100.00
------------+-----------------------------------
      Total |         96      100.00
Click to Open File:  telesafe_results_cons_level.doc

. asdoc tab sna_and_fu_cons
(File telesafe_results_cons_level.doc already exists, option append was assumed)

sna_and_fu_ |
       cons |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4        4.17        4.17
          1 |         52       54.17       58.33
          2 |         40       41.67      100.00
------------+-----------------------------------
      Total |         96      100.00
Click to Open File:  telesafe_results_cons_level.doc

. 
. asdoc tab any_sna_cons pt_safety_netting, missing
(File telesafe_results_cons_level.doc already exists, option append was assumed)

any_sna_co |          Did HCP explain what to do if worse?
        ns |       Yes         No   Not sure  Does not           . |     Total
-----------+-------------------------------------------------------+----------
         0 |        13         10          4          8          3 |        38 
         1 |        38          8          3          6          3 |        58 
-----------+-------------------------------------------------------+----------
     Total |        51         18          7         14          6 |        96 
Click to Open File:  telesafe_results_cons_level.doc

. asdoc tab any_sna_cons pt_safety_netting, row
(File telesafe_results_cons_level.doc already exists, option append was assumed)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

any_sna_co |    Did HCP explain what to do if worse?
        ns |       Yes         No   Not sure  Does not  |     Total
-----------+--------------------------------------------+----------
         0 |        13         10          4          8 |        35 
           |     37.14      28.57      11.43      22.86 |    100.00 
-----------+--------------------------------------------+----------
         1 |        38          8          3          6 |        55 
           |     69.09      14.55       5.45      10.91 |    100.00 
-----------+--------------------------------------------+----------
     Total |        51         18          7         14 |        90 
           |     56.67      20.00       7.78      15.56 |    100.00 
Click to Open File:  telesafe_results_cons_level.doc

. 
. asdoc tab practice_dep_cat pt_safety_netting if any_sna_cons ==1, row
(File telesafe_results_cons_level.doc already exists, option append was assumed)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Did HCP explain what to do if worse?
  __000000 |       Yes         No   Not sure  Does not  |     Total
-----------+--------------------------------------------+----------
  affluent |        20          5          1          4 |        30 
           |     66.67      16.67       3.33      13.33 |    100.00 
-----------+--------------------------------------------+----------
  deprived |        14          2          1          2 |        19 
           |     73.68      10.53       5.26      10.53 |    100.00 
-----------+--------------------------------------------+----------
    middle |         4          1          1          0 |         6 
           |     66.67      16.67      16.67       0.00 |    100.00 
-----------+--------------------------------------------+----------
     Total |        38          8          3          6 |        55 
           |     69.09      14.55       5.45      10.91 |    100.00 
Click to Open File:  telesafe_results_cons_level.doc

. asdoc tab practice_dep_cat pt_safety_netting if any_sna_cons ==0, row
(File telesafe_results_cons_level.doc already exists, option append was assumed)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Did HCP explain what to do if worse?
  __000000 |       Yes         No   Not sure  Does not  |     Total
-----------+--------------------------------------------+----------
  affluent |        12          7          3          6 |        28 
           |     42.86      25.00      10.71      21.43 |    100.00 
-----------+--------------------------------------------+----------
  deprived |         1          3          1          2 |         7 
           |     14.29      42.86      14.29      28.57 |    100.00 
-----------+--------------------------------------------+----------
     Total |        13         10          4          8 |        35 
           |     37.14      28.57      11.43      22.86 |    100.00 
Click to Open File:  telesafe_results_cons_level.doc

. 
. **documentation
. asdoc tab sna_doc_cons if any_sna_cons ==1, missing
(File telesafe_results_cons_level.doc already exists, option append was assumed)

                    sna_doc_cons |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
     0 = No documentation of SNA |         19       32.76       32.76
1 = Documentation of SNA present |         34       58.62       91.38
          88 = CBD as NO RECORDS |          5        8.62      100.00
---------------------------------+-----------------------------------
                           Total |         58      100.00
(file telesafe_results_cons_level.doc not found)
Click to Open File:  telesafe_results_cons_level.doc

. asdoc tab sna_doc_cons if any_sna_cons ==1 & sna_doc_cons!=3, missing
(File telesafe_results_cons_level.doc already exists, option append was assumed)

                    sna_doc_cons |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
     0 = No documentation of SNA |         19       35.85       35.85
1 = Documentation of SNA present |         34       64.15      100.00
---------------------------------+-----------------------------------
                           Total |         53      100.00
Click to Open File:  telesafe_results_cons_level.doc

. 
. **** Prob level**********************************************
. asdoc, text(Telesafe Results) fs(15) save(telesafe_results_prob_level) replace
(file telesafe_results_prob_level.doc not found)
Click to Open File:  telesafe_results_prob_level.doc

. use  one_line_per_problem.dta, clear

. 
. *documentation
. asdoc tab sna_doc if any_sna==1
(File telesafe_results_prob_level.doc already exists, option append was assumed)

                         sna_doc |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
     0 = No documentation of SNA |         28       38.89       38.89
1 = Documentation of SNA present |         39       54.17       93.06
          88 = CBD as NO RECORDS |          5        6.94      100.00
---------------------------------+-----------------------------------
                           Total |         72      100.00
Click to Open File:  telesafe_results_prob_level.doc

. asdoc tab sna_doc if any_sna==1 & sna_doc !="88 = CBD as NO RECORDS"
(File telesafe_results_prob_level.doc already exists, option append was assumed)

                         sna_doc |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
     0 = No documentation of SNA |         28       41.79       41.79
1 = Documentation of SNA present |         39       58.21      100.00
---------------------------------+-----------------------------------
                           Total |         67      100.00
Click to Open File:  telesafe_results_prob_level.doc

. 
. *coms
. asdoc tab sna_coms
(File telesafe_results_prob_level.doc already exists, option append was assumed)

              sna_coms |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
       1 = Verbal only |         67       93.06       93.06
2 = Verbal and written |          3        4.17       97.22
           3 = unclear |          1        1.39       98.61
          written only |          1        1.39      100.00
-----------------------+-----------------------------------
                 Total |         72      100.00
Click to Open File:  telesafe_results_prob_level.doc

. list consent_id if sna_coms !="1 = Verbal only" & sna_coms!=""

     +----------+
     | conse~id |
     |----------|
 41. |       [redacted |
 42. |       [redacted |
 72. |       [redacted |
110. |     [redacted |
155. |     [redacted |
     +----------+

. * to work out coms level = 4 unique 
. 
. asdoc tab any_sna
(File telesafe_results_prob_level.doc already exists, option append was assumed)

    any_sna |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         94       56.63       56.63
          1 |         72       43.37      100.00
------------+-----------------------------------
      Total |        166      100.00
Click to Open File:  telesafe_results_prob_level.doc

. asdoc tab any_fu
(File telesafe_results_prob_level.doc already exists, option append was assumed)

           any_fu |      Freq.     Percent        Cum.
------------------+-----------------------------------
     No follow up |         59       35.54       35.54
Follow up present |        107       64.46      100.00
------------------+-----------------------------------
            Total |        166      100.00
Click to Open File:  telesafe_results_prob_level.doc

. asdoc tab any_sna_or_fu
(File telesafe_results_prob_level.doc already exists, option append was assumed)

any_sna_or_ |
         fu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         27       16.27       16.27
          1 |        139       83.73      100.00
------------+-----------------------------------
      Total |        166      100.00
Click to Open File:  telesafe_results_prob_level.doc

. asdoc tab sna_and_fu
(File telesafe_results_prob_level.doc already exists, option append was assumed)

 sna_and_fu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         27       16.27       16.27
          1 |         99       59.64       75.90
          2 |         40       24.10      100.00
------------+-----------------------------------
      Total |        166      100.00
Click to Open File:  telesafe_results_prob_level.doc

. 
. asdoc tab sna_conditionals_unique
(File telesafe_results_prob_level.doc already exists, option append was assumed)

sna_conditi |
onals_uniqu |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         37       51.39       51.39
          2 |         12       16.67       68.06
          3 |          7        9.72       77.78
          4 |          3        4.17       81.94
          5 |          5        6.94       88.89
          6 |          4        5.56       94.44
          8 |          2        2.78       97.22
         11 |          1        1.39       98.61
         16 |          1        1.39      100.00
------------+-----------------------------------
      Total |         72      100.00
Click to Open File:  telesafe_results_prob_level.doc

. asdoc tabstat sna_conditionals_unique, stat(mean median sd min max range) 
(File telesafe_results_prob_level.doc already exists, option append was assumed)

             |      Mean        p50         SD        Min        Max      Range 
-------------+-----------------------------------------------------------------
sna_condit~e |  2.583333          1   2.625713          1         16         15 
Click to Open File:  telesafe_results_prob_level.doc

. 
. asdoc tab icpc3_cat_long
(File telesafe_results_prob_level.doc already exists, option append was assumed)

                               __000000 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                            A - General |         31       18.67       18.67
B - Blood, blood-forming organs and imm |          4        2.41       21.08
                   D - Digestive system |         17       10.24       31.33
                                F - Eye |          2        1.20       32.53
                     G - Genital system |         17       10.24       42.77
                                H - Ear |          2        1.20       43.98
                 K - Circulatory system |         16        9.64       53.61
             L - Musculoskeletal system |         19       11.45       65.06
                N - Neurological system |          6        3.61       68.67
P - Psychological, mental and neurodeve |          7        4.22       72.89
                 R - Respiratory system |          7        4.22       77.11
                               S - Skin |         13        7.83       84.94
T - Endocrine, metabolic and nutritiona |         13        7.83       92.77
                     U - Urinary system |          9        5.42       98.19
         W - Pregnancy and childbearing |          2        1.20       99.40
                    Z - Social problems |          1        0.60      100.00
----------------------------------------+-----------------------------------
                                  Total |        166      100.00
Click to Open File:  telesafe_results_prob_level.doc

. asdoc tab icpc3_update_full if icpc3_cat =="A"
(File telesafe_results_prob_level.doc already exists, option append was assumed)

                      icpc3_update_full |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                 A310 Polypharmacy care |          3        9.68        9.68
A310 Polypharmacy care - within discuss |          1        3.23       12.90
                   AD24.05 Lyme disease |          1        3.23       16.13
AD36 Other specified and unknown trauma |          1        3.23       19.35
        AD37 Secondary effect of trauma |          2        6.45       25.81
   AD41 Adverse effect of medical agent |          3        9.68       35.48
  AD43 Side-effect of prosthetic device |          1        3.23       38.71
AD44 Toxic effect of non-medicinal subs |          1        3.23       41.94
        AF03 Intrauterine contraception |          1        3.23       45.16
AF03 Intrauterine contraception or ?GS0 |          1        3.23       48.39
AG02 Other specified general examinatio |          1        3.23       51.61
AG04 Routine general health check-up of |          1        3.23       54.84
AP16 Special screening examination for  |          4       12.90       67.74
    AS01 General pain in multiple sites |          1        3.23       70.97
     AS04 General weakness or tiredness |          2        6.45       77.42
                 AS05 Postviral fatigue |          1        3.23       80.65
       AS05.00 Chronic fatigue syndrome |          1        3.23       83.87
 AS11 Bleeding (site unknown from call) |          1        3.23       87.10
AS50 Other specified abnormal result in |          2        6.45       93.55
AS50 Other specified abnormal result in |          1        3.23       96.77
AS50.00 Elevated blood glucose level (p |          1        3.23      100.00
----------------------------------------+-----------------------------------
                                  Total |         31      100.00
Click to Open File:  telesafe_results_prob_level.doc

. 
. asdoc tab icpc3_cat_long any_sna
(File telesafe_results_prob_level.doc already exists, option append was assumed)

                      |        any_sna
             __000000 |         0          1 |     Total
----------------------+----------------------+----------
          A - General |        18         13 |        31 
B - Blood, blood-form |         2          2 |         4 
 D - Digestive system |        13          4 |        17 
              F - Eye |         1          1 |         2 
   G - Genital system |         9          8 |        17 
              H - Ear |         1          1 |         2 
K - Circulatory syste |         7          9 |        16 
L - Musculoskeletal s |        10          9 |        19 
N - Neurological syst |         3          3 |         6 
P - Psychological, me |         3          4 |         7 
R - Respiratory syste |         2          5 |         7 
             S - Skin |         8          5 |        13 
T - Endocrine, metabo |         9          4 |        13 
   U - Urinary system |         6          3 |         9 
W - Pregnancy and chi |         1          1 |         2 
  Z - Social problems |         1          0 |         1 
----------------------+----------------------+----------
                Total |        94         72 |       166 
Click to Open File:  telesafe_results_prob_level.doc

. asdoc tab icpc3_cat_long any_fu
(File telesafe_results_prob_level.doc already exists, option append was assumed)

                      |        any_fu
             __000000 | No follow  Follow up |     Total
----------------------+----------------------+----------
          A - General |        11         20 |        31 
B - Blood, blood-form |         1          3 |         4 
 D - Digestive system |         8          9 |        17 
              F - Eye |         2          0 |         2 
   G - Genital system |         4         13 |        17 
              H - Ear |         2          0 |         2 
K - Circulatory syste |         2         14 |        16 
L - Musculoskeletal s |         4         15 |        19 
N - Neurological syst |         2          4 |         6 
P - Psychological, me |         4          3 |         7 
R - Respiratory syste |         4          3 |         7 
             S - Skin |         6          7 |        13 
T - Endocrine, metabo |         4          9 |        13 
   U - Urinary system |         2          7 |         9 
W - Pregnancy and chi |         2          0 |         2 
  Z - Social problems |         1          0 |         1 
----------------------+----------------------+----------
                Total |        59        107 |       166 
Click to Open File:  telesafe_results_prob_level.doc

. asdoc tab icpc3_cat_long any_sna_or_fu
(File telesafe_results_prob_level.doc already exists, option append was assumed)

                      |     any_sna_or_fu
             __000000 |         0          1 |     Total
----------------------+----------------------+----------
          A - General |         6         25 |        31 
B - Blood, blood-form |         0          4 |         4 
 D - Digestive system |         6         11 |        17 
              F - Eye |         1          1 |         2 
   G - Genital system |         1         16 |        17 
              H - Ear |         1          1 |         2 
K - Circulatory syste |         1         15 |        16 
L - Musculoskeletal s |         1         18 |        19 
N - Neurological syst |         0          6 |         6 
P - Psychological, me |         1          6 |         7 
R - Respiratory syste |         1          6 |         7 
             S - Skin |         3         10 |        13 
T - Endocrine, metabo |         2         11 |        13 
   U - Urinary system |         1          8 |         9 
W - Pregnancy and chi |         1          1 |         2 
  Z - Social problems |         1          0 |         1 
----------------------+----------------------+----------
                Total |        27        139 |       166 
Click to Open File:  telesafe_results_prob_level.doc

. 
. ************* models
. 
. * Acuity
. asdoc tab acuity_ any_sna, row 
(File telesafe_results_prob_level.doc already exists, option append was assumed)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        any_sna
               acuity |         0          1 |     Total
----------------------+----------------------+----------
              Chronic |        51         31 |        82 
                      |     62.20      37.80 |    100.00 
----------------------+----------------------+----------
Acute / Acute on Chro |        43         41 |        84 
                      |     51.19      48.81 |    100.00 
----------------------+----------------------+----------
                Total |        94         72 |       166 
                      |     56.63      43.37 |    100.00 
Click to Open File:  telesafe_results_prob_level.doc

. quietly xi: melogit any_sna i.acuity_ || practice_id: || gp_id2: ||consent_id:, or

. reformat, output(necp) dpp(3) eform dpcoef(2) cw(35)

MEGLM formatted output

Outcome variable: any_sna , n=166
-----------------------------------------------------------------------------------------
Covariate                                   N  exp(coef.)    95% Conf. Interval     P>|z|
-----------------------------------------------------------------------------------------
Acuity                                                                           
  Chronic*                                 82           1                                
  Acute / Acute on Chronic                 84        2.67        (0.95 to 7.55)     0.063
-----------------------------------------------------------------------------------------
* Baseline category

. 
. * First presentation
. asdoc tab first_pres_ any_sna, row
(File telesafe_results_prob_level.doc already exists, option append was assumed)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        any_sna
           first_pres |         0          1 |     Total
----------------------+----------------------+----------
0 = No (not first pre |        71         56 |       127 
                      |     55.91      44.09 |    100.00 
----------------------+----------------------+----------
1 = Yes (first presen |        16         13 |        29 
                      |     55.17      44.83 |    100.00 
----------------------+----------------------+----------
         88 = unclear |         7          3 |        10 
                      |     70.00      30.00 |    100.00 
----------------------+----------------------+----------
                Total |        94         72 |       166 
                      |     56.63      43.37 |    100.00 
Click to Open File:  telesafe_results_prob_level.doc

. quietly xi: melogit any_sna i.first_pres_ || practice_id: || gp_id2: || consent_id:, or

. reformat, output(necp) dpp(3) eform dpcoef(2) cw(35)

MEGLM formatted output

Outcome variable: any_sna , n=166
-----------------------------------------------------------------------------------------
Covariate                                   N  exp(coef.)    95% Conf. Interval     P>|z|
-----------------------------------------------------------------------------------------
First_pres                                                                       
  0 = No (not first presentation to HCP)*       127           1                                
  1 = Yes (first presentation to HCP)        29        1.46        (0.45 to 4.77)     0.527
  88 = unclear                             10        0.38        (0.06 to 2.45)     0.307
-----------------------------------------------------------------------------------------
* Baseline category

. 
. *prob order
. asdoc tab prob_no any_sna, row
(File telesafe_results_prob_level.doc already exists, option append was assumed)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |        any_sna
   prob_no |         0          1 |     Total
-----------+----------------------+----------
         1 |        47         49 |        96 
           |     48.96      51.04 |    100.00 
-----------+----------------------+----------
         2 |        26         17 |        43 
           |     60.47      39.53 |    100.00 
-----------+----------------------+----------
         3 |        16          5 |        21 
           |     76.19      23.81 |    100.00 
-----------+----------------------+----------
         4 |         3          1 |         4 
           |     75.00      25.00 |    100.00 
-----------+----------------------+----------
         5 |         2          0 |         2 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
     Total |        94         72 |       166 
           |     56.63      43.37 |    100.00 
Click to Open File:  telesafe_results_prob_level.doc

. quietly xi: melogit any_sna prob_no || practice_id: || gp_id2: || consent_id:, or

. reformat, output(necp) dpp(3) eform dpcoef(2) cw(35)

MEGLM formatted output

Outcome variable: any_sna , n=166
-----------------------------------------------------------------------------------------
Covariate                                   N  exp(coef.)    95% Conf. Interval     P>|z|
-----------------------------------------------------------------------------------------
Prob_no                                                                          
  per unit                                166        0.54        (0.33 to 0.91)     0.020
-----------------------------------------------------------------------------------------

. 
. * Any follow-up
. asdoc tab any_fu any_sna, row
(File telesafe_results_prob_level.doc already exists, option append was assumed)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                  |        any_sna
           any_fu |         0          1 |     Total
------------------+----------------------+----------
     No follow up |        27         32 |        59 
                  |     45.76      54.24 |    100.00 
------------------+----------------------+----------
Follow up present |        67         40 |       107 
                  |     62.62      37.38 |    100.00 
------------------+----------------------+----------
            Total |        94         72 |       166 
                  |     56.63      43.37 |    100.00 
Click to Open File:  telesafe_results_prob_level.doc

. quietly xi: melogit any_sna i.any_fu || practice_id: || gp_id2: || consent_id:, or

. reformat, output(necp) dpp(3) eform dpcoef(2)  cw(35)

MEGLM formatted output

Outcome variable: any_sna , n=166
-----------------------------------------------------------------------------------------
Covariate                                   N  exp(coef.)    95% Conf. Interval     P>|z|
-----------------------------------------------------------------------------------------
Any_fu                                                                           
  No follow up*                            59           1                                
  Follow up present                       107        0.49        (0.21 to 1.14)     0.097
-----------------------------------------------------------------------------------------
* Baseline category

. 
. * GP age45
. asdoc tab gp_age_45 any_sna, row
(File telesafe_results_prob_level.doc already exists, option append was assumed)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

            |        any_sna
  gp_age_45 |         0          1 |     Total
------------+----------------------+----------
GP age >=45 |        59         32 |        91 
            |     64.84      35.16 |    100.00 
------------+----------------------+----------
 GP age <45 |        35         40 |        75 
            |     46.67      53.33 |    100.00 
------------+----------------------+----------
      Total |        94         72 |       166 
            |     56.63      43.37 |    100.00 
Click to Open File:  telesafe_results_prob_level.doc

. quietly xi: melogit any_sna i.gp_age_45 || practice_id: || gp_id2: || consent_id:, or base

. reformat, output(necp) dpp(3) eform dpcoef(2) cw(35)

MEGLM formatted output

Outcome variable: any_sna , n=166
-----------------------------------------------------------------------------------------
Covariate                                   N  exp(coef.)    95% Conf. Interval     P>|z|
-----------------------------------------------------------------------------------------
Gp_age_45                                                                        
  GP age >=45*                             91           1                                
  GP age <45                               75        3.56       (1.11 to 11.39)     0.033
-----------------------------------------------------------------------------------------
* Baseline category

. 
end of do-file

. do "[REDACTED SERVER]\STD1cf0_000008.tmp"

. quietly xi: melogit any_sna i.acuity_ i.first_pres_ prob_no i.any_fu i.gp_age_45 i.pt_age_65 i.pt_gender i.practice_dep_cat_ || practice_id: || gp_
> id2: || consent_id:, base or

. reformat, output(necp) dpp(3) eform dpcoef(2) cw(45)

MEGLM formatted output

Outcome variable: any_sna , n=165
---------------------------------------------------------------------------------------------------
Covariate                                             N  exp(coef.)    95% Conf. Interval     P>|z|
---------------------------------------------------------------------------------------------------
Acuity                                                                                     
  Chronic*                                           82           1                                
  Acute / Acute on Chronic                           83        1.69        (0.57 to 5.02)     0.344
First_pres                                                                                 
  0 = No (not first presentation to HCP)*           126           1                                
  1 = Yes (first presentation to HCP)                29        1.18        (0.34 to 4.07)     0.792
  88 = unclear                                       10        0.38        (0.05 to 2.80)     0.345
Prob_no                                                                                    
  per unit                                          165        0.60        (0.35 to 1.04)     0.067
Any_fu                                                                                     
  No follow up*                                      59           1                                
  Follow up present                                 106        0.62        (0.25 to 1.55)     0.306
Gp_age_45                                                                                  
  GP age >=45*                                       91           1                                
  GP age <45                                         74        5.09       (1.45 to 17.89)     0.011
Pt_age_65                                                                                  
  Patient age <65*                                   71           1                                
  Patient age >=65                                   94        0.98        (0.33 to 2.93)     0.975
Gender                                                                                     
  Male*                                              55           1                                
  Female                                            110        1.39        (0.47 to 4.11)     0.550
Practice_dep_cat_                                                                          
  Affluent IMD=9-10*                                 99           1                                
  Deprived IMD=1-2                                   57        3.37       (0.93 to 12.25)     0.065
  Middle IMD=5                                        9        9.50      (0.86 to 105.35)     0.067
---------------------------------------------------------------------------------------------------
* Baseline category

. 
. *** safety-netting episode level**
. asdoc, text(Telesafe Results) fs(15) save(telesafe_results_sancot_level) replace
(file telesafe_results_sancot_level.doc not found)
Click to Open File:  telesafe_results_sancot_level.doc

. 
. use telesafe_sancot.dta, clear

. 
. asdoc tab sna_order
(File telesafe_results_sancot_level.doc already exists, option append was assumed)

  sna_order |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         71       70.30       70.30
          2 |         19       18.81       89.11
          3 |          8        7.92       97.03
          4 |          2        1.98       99.01
          5 |          1        0.99      100.00
------------+-----------------------------------
      Total |        101      100.00
Click to Open File:  telesafe_results_sancot_level.doc

. asdoc tab sna_single_or_multiple_probs
(File telesafe_results_sancot_level.doc already exists, option append was assumed)

sna_single_or_multiple |
                _probs |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
1 = This problem only  |         83       90.22       90.22
 2 = Multiple Problems |          8        8.70       98.91
                list c |          1        1.09      100.00
-----------------------+-----------------------------------
                 Total |         92      100.00
Click to Open File:  telesafe_results_sancot_level.doc

. asdoc tab sna_applies
(File telesafe_results_sancot_level.doc already exists, option append was assumed)

                            sna_applies |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                            1 = Problem |         62       67.39       67.39
        2 = Treatment / Management Plan |         16       17.39       84.78
3 = Both (often if vague but can be mix |         14       15.22      100.00
----------------------------------------+-----------------------------------
                                  Total |         92      100.00
Click to Open File:  telesafe_results_sancot_level.doc

. asdoc tab sna_stage
(File telesafe_results_sancot_level.doc already exists, option append was assumed)

                sna_stage |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
2 = Gathering Information |          2        2.17        2.17
 3 = Delivering Diagnoses |          8        8.70       10.87
   4 = Treatment Planning |         61       66.30       77.17
              5 = Closing |         19       20.65       97.83
        post consultation |          2        2.17      100.00
--------------------------+-----------------------------------
                    Total |         92      100.00
(file telesafe_results_sancot_level.doc not found)
Click to Open File:  telesafe_results_sancot_level.doc

. asdoc tab sna_init
(File telesafe_results_sancot_level.doc already exists, option append was assumed)

     sna_init |      Freq.     Percent        Cum.
--------------+-----------------------------------
1 = Clinician |         88       95.65       95.65
  2 = Patient |          4        4.35      100.00
--------------+-----------------------------------
        Total |         92      100.00
Click to Open File:  telesafe_results_sancot_level.doc

. asdoc tab sna_format
(File telesafe_results_sancot_level.doc already exists, option append was assumed)

                        sna_format |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
             0 = Conditional Only  |          5        5.43        5.43
1 = Conditional + Course of Action |         87       94.57      100.00
-----------------------------------+-----------------------------------
                             Total |         92      100.00
Click to Open File:  telesafe_results_sancot_level.doc

. asdoc tab sna_strength
(File telesafe_results_sancot_level.doc already exists, option append was assumed)

                           sna_strength |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                0 = Weaker (can, could) |         24       26.09       26.09
                            1 = Neutral |         46       50.00       76.09
2 = Stronger (must, should, need to, th |         22       23.91      100.00
----------------------------------------+-----------------------------------
                                  Total |         92      100.00
Click to Open File:  telesafe_results_sancot_level.doc

. asdoc tab sna_conditionals
(File telesafe_results_sancot_level.doc already exists, option append was assumed)

sna_conditi |
      onals |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         59       64.13       64.13
          2 |         17       18.48       82.61
          3 |          5        5.43       88.04
          4 |          1        1.09       89.13
          5 |          3        3.26       92.39
          6 |          5        5.43       97.83
         11 |          1        1.09       98.91
         13 |          1        1.09      100.00
------------+-----------------------------------
      Total |         92      100.00
Click to Open File:  telesafe_results_sancot_level.doc

. *asdoc tab sna_conditions_text - not for publication
. asdoc tabstat sna_conditionals, stat(mean median sd min max range) 
(File telesafe_results_sancot_level.doc already exists, option append was assumed)

             |      Mean        p50         SD        Min        Max      Range 
-------------+-----------------------------------------------------------------
sna_condit~s |  1.967391          1   2.035137          1         13         12 
Click to Open File:  telesafe_results_sancot_level.doc

. asdoc tab sna_specific
(File telesafe_results_sancot_level.doc already exists, option append was assumed)

     sna_specific |      Freq.     Percent        Cum.
------------------+-----------------------------------
      0 = Generic |         33       35.87       35.87
          1 = G&S |         15       16.30       52.17
2 = Specific only |         44       47.83      100.00
------------------+-----------------------------------
            Total |         92      100.00
Click to Open File:  telesafe_results_sancot_level.doc

. asdoc tab sna_stage sna_specific_bin
(File telesafe_results_sancot_level.doc already exists, option append was assumed)

                      |       __000001
            sna_stage |   generic   specific |     Total
----------------------+----------------------+----------
2 = Gathering Informa |         1          1 |         2 
3 = Delivering Diagno |         0          8 |         8 
4 = Treatment Plannin |        19         42 |        61 
          5 = Closing |        13          6 |        19 
    post consultation |         0          2 |         2 
----------------------+----------------------+----------
                Total |        33         59 |        92 
Click to Open File:  telesafe_results_sancot_level.doc

. asdoc tab sna_action
(File telesafe_results_sancot_level.doc already exists, option append was assumed)

                             sna_action |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                  0 = No action advised |          5        5.43        5.43
1 = Other IN HOURS HCP (not based at pr |          2        2.17        7.61
       2 = Return to / contact practice |         50       54.35       61.96
                 3 = Return to same HCP |         22       23.91       85.87
              4 = Contact OOH / NHS 111 |          1        1.09       86.96
5 = Contact emergency services e.g. 999 |          7        7.61       94.57
                           6 = multiple |          2        2.17       96.74
               unspecified medical help |          3        3.26      100.00
----------------------------------------+-----------------------------------
                                  Total |         92      100.00
Click to Open File:  telesafe_results_sancot_level.doc

. asdoc tab sna_action_focus
(File telesafe_results_sancot_level.doc already exists, option append was assumed)

              sna_action_focus |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
                 1 = Clinician |         29       31.52       31.52
                   2 = Patient |         34       36.96       68.48
  3 = Both Clinician & Patient |         24       26.09       94.57
99 = N/A - no action component |          5        5.43      100.00
-------------------------------+-----------------------------------
                         Total |         92      100.00
Click to Open File:  telesafe_results_sancot_level.doc

. asdoc tab sna_timescale
(File telesafe_results_sancot_level.doc already exists, option append was assumed)

                    sna_timescale |      Freq.     Percent        Cum.
----------------------------------+-----------------------------------
                0 = Not specified |         59       64.13       64.13
1 = Named Day / fixed time period |         28       30.43       94.57
           2 = Immediate / Urgent |          5        5.43      100.00
----------------------------------+-----------------------------------
                            Total |         92      100.00
Click to Open File:  telesafe_results_sancot_level.doc

. asdoc tab sna_pt_response
(File telesafe_results_sancot_level.doc already exists, option append was assumed)

                        sna_pt_response |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                        0 = No response |          8        8.70        8.70
      1 = Resists, aligns / misaligning |         24       26.09       34.78
3 = Acknowledgement (yeah, right, umm), |         59       64.13       98.91
                               CBD text |          1        1.09      100.00
----------------------------------------+-----------------------------------
                                  Total |         92      100.00
Click to Open File:  telesafe_results_sancot_level.doc

. asdoc tab sna_questions
(File telesafe_results_sancot_level.doc already exists, option append was assumed)

                          sna_questions |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 0 = no questions asked about SN advice |         84       91.30       91.30
1 = patient asks a question about SN ad |          8        8.70      100.00
----------------------------------------+-----------------------------------
                                  Total |         92      100.00
Click to Open File:  telesafe_results_sancot_level.doc

. asdoc tab sna_coms
(File telesafe_results_sancot_level.doc already exists, option append was assumed)

              sna_coms |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
       1 = Verbal only |         87       94.57       94.57
2 = Verbal and written |          3        3.26       97.83
           3 = unclear |          1        1.09       98.91
          written only |          1        1.09      100.00
-----------------------+-----------------------------------
                 Total |         92      100.00
Click to Open File:  telesafe_results_sancot_level.doc

. asdoc tab sna_coms if extra_append==0
(File telesafe_results_sancot_level.doc already exists, option append was assumed)

              sna_coms |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
       1 = Verbal only |         61       92.42       92.42
2 = Verbal and written |          3        4.55       96.97
           3 = unclear |          1        1.52       98.48
          written only |          1        1.52      100.00
-----------------------+-----------------------------------
                 Total |         66      100.00
Click to Open File:  telesafe_results_sancot_level.doc
. *unclear = text app, confirmed app does contain sna for this condition

. asdoc tab sna_doc if extra_append==0
(File telesafe_results_sancot_level.doc already exists, option append was assumed)

                         sna_doc |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
     0 = No documentation of SNA |         28       38.36       38.36
1 = Documentation of SNA present |         39       53.42       91.78
          88 = CBD as NO RECORDS |          5        6.85       98.63
               doc but no verbal |          1        1.37      100.00
---------------------------------+-----------------------------------
                           Total |         73      100.00
Click to Open File:  telesafe_results_sancot_level.doc

. 
. 
. clear

. 
. *** 
. asdoc, text(Telesafe Results) fs(15) save(telesafe_results_hcp_questionnare) replace
(file telesafe_results_hcp_questionnare.doc not found)
Click to Open File:  telesafe_results_hcp_questionnare.doc

. 
. use hcp_survey_data_from_all_data_manual_corrected.dta, clear
(OneInAMillionTELESAF_DATA_NOHDRS_2025-02-25_1406.csv)

. asdoc tab hcp_verbal_sna
(File telesafe_results_hcp_questionnare.doc already exists, option append was assumed)

      Frequency of verbal |
    safety-netting advice |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
       Sometimes (25-49%) |          2        7.14        7.14
           Often (50-69%) |         12       42.86       50.00
Most of the time (70-89%) |          8       28.57       78.57
     Almost always (90%) |          6       21.43      100.00
--------------------------+-----------------------------------
                    Total |         28      100.00
Click to Open File:  telesafe_results_hcp_questionnare.doc

. asdoc tab hcp_verbal_sna if has_cons == 1
(File telesafe_results_hcp_questionnare.doc already exists, option append was assumed)

      Frequency of verbal |
    safety-netting advice |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
       Sometimes (25-49%) |          1        5.00        5.00
           Often (50-69%) |         11       55.00       60.00
Most of the time (70-89%) |          6       30.00       90.00
     Almost always (90%) |          2       10.00      100.00
--------------------------+-----------------------------------
                    Total |         20      100.00
Click to Open File:  telesafe_results_hcp_questionnare.doc

. 
. asdoc tab hcp_written_sna
(File telesafe_results_hcp_questionnare.doc already exists, option append was assumed)

     Frequency of written |
    safety-netting advice |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
           Rarely (< 25%) |         12       42.86       42.86
       Sometimes (25-49%) |          8       28.57       71.43
           Often (50-69%) |          2        7.14       78.57
Most of the time (70-89%) |          3       10.71       89.29
     Almost always (90%) |          3       10.71      100.00
--------------------------+-----------------------------------
                    Total |         28      100.00
Click to Open File:  telesafe_results_hcp_questionnare.doc

. asdoc tab hcp_written_sna if has_cons == 1
(File telesafe_results_hcp_questionnare.doc already exists, option append was assumed)

     Frequency of written |
    safety-netting advice |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
           Rarely (< 25%) |         10       50.00       50.00
       Sometimes (25-49%) |          7       35.00       85.00
           Often (50-69%) |          2       10.00       95.00
Most of the time (70-89%) |          1        5.00      100.00
--------------------------+-----------------------------------
                    Total |         20      100.00
Click to Open File:  telesafe_results_hcp_questionnare.doc

. 
. asdoc tab hcp_sna_importance
(File telesafe_results_hcp_questionnare.doc already exists, option append was assumed)

     SNA is important and |
    benefits patient care |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
Neither agree or disagree |          1        3.57        3.57
                    Agree |         12       42.86       46.43
           Strongly agree |         15       53.57      100.00
--------------------------+-----------------------------------
                    Total |         28      100.00
Click to Open File:  telesafe_results_hcp_questionnare.doc

. asdoc tab hcp_sna_importance if has_cons == 1
(File telesafe_results_hcp_questionnare.doc already exists, option append was assumed)

     SNA is important and |
    benefits patient care |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
Neither agree or disagree |          1        5.00        5.00
                    Agree |         10       50.00       55.00
           Strongly agree |          9       45.00      100.00
--------------------------+-----------------------------------
                    Total |         20      100.00
Click to Open File:  telesafe_results_hcp_questionnare.doc

. 
. asdoc tab hcp_sna_demand
(File telesafe_results_hcp_questionnare.doc already exists, option append was assumed)

   SNA leads to increased |
           patient demand |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
        Strongly disagree |          2        7.14        7.14
                 Disagree |         11       39.29       46.43
Neither agree or disagree |         12       42.86       89.29
                    Agree |          3       10.71      100.00
--------------------------+-----------------------------------
                    Total |         28      100.00
Click to Open File:  telesafe_results_hcp_questionnare.doc

. asdoc tab hcp_sna_demand if has_cons == 1
(File telesafe_results_hcp_questionnare.doc already exists, option append was assumed)

   SNA leads to increased |
           patient demand |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
        Strongly disagree |          1        5.00        5.00
                 Disagree |          9       45.00       50.00
Neither agree or disagree |          9       45.00       95.00
                    Agree |          1        5.00      100.00
--------------------------+-----------------------------------
                    Total |         20      100.00
Click to Open File:  telesafe_results_hcp_questionnare.doc

. 
. asdoc tab hcp_sna_reason
(File telesafe_results_hcp_questionnare.doc already exists, option append was assumed)

  Main reason for giving safety-netting |
                                 advice |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                           Patient care |          1        3.57        3.57
Mostly patient care some medico-legal c |         11       39.29       42.86
Equal patient care and medico-legal cov |         15       53.57       96.43
Mostly medico-legal cover some patient  |          1        3.57      100.00
----------------------------------------+-----------------------------------
                                  Total |         28      100.00
Click to Open File:  telesafe_results_hcp_questionnare.doc

. asdoc tab hcp_sna_reason if has_cons == 1
(File telesafe_results_hcp_questionnare.doc already exists, option append was assumed)

  Main reason for giving safety-netting |
                                 advice |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                           Patient care |          1        5.00        5.00
Mostly patient care some medico-legal c |          7       35.00       40.00
Equal patient care and medico-legal cov |         12       60.00      100.00
----------------------------------------+-----------------------------------
                                  Total |         20      100.00
Click to Open File:  telesafe_results_hcp_questionnare.doc

. 
. 
. ***** patient recall***
. use one_line_per_cons.dta, clear

. tab  pt_safety_netting any_sna_cons

       Did HCP |
  explain what |
      to do if |     any_sna_cons
        worse? |         0          1 |     Total
---------------+----------------------+----------
           Yes |        13         38 |        51 
            No |        10          8 |        18 
      Not sure |         4          3 |         7 
Does not apply |         8          6 |        14 
---------------+----------------------+----------
         Total |        35         55 |        90 

. 
. log close
      name:  <unnamed>
       log:  [REDACTED SERVER]\telesafe_safety_netting_results.log
  log type:  text
 closed on:  28 Sep 2025, 14:17:00
-----------------------------------------------------------------------------------------------------------------------------------------------------
