
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 19.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2025 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 2-core network, expiring 29 Jan 2026
Serial number: REDACTED
  Licensed to: IT Services
               University of Bristol

Notes:
      1. Unicode is supported; see help unicode_advice.
      2. More than 2 billion observations are allowed; see help obs_advice.
      3. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

Running C:\Program Files\StataNow19\profile.do ...

. do "[REDACTED SERVER]\safety-netting\do files\Telesafe results_final_post_peer_review.do"

. clear

. 
. cd "[REDACTED SERVER]\safety-netting"
[REDACTED SERVER]\safety-netting

. capture log close

. log using "telesafe_safety_netting_results.log", replace text
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  [REDACTED SERVER]\safety-netting\telesafe_safety_netting_results.log
  log type:  text
 opened on:  17 Dec 2025, 15:16:04

. 
. 
. asdoc, text(Telesafe Results) fs(15) save(telesafe_results) replace
(file telesafe_results.doc not found)
Click to Open File:  telesafe_results.doc

. 
. ** cons level
. 
. use one_line_per_cons.dta, clear

. 
. *table 1
. 
. asdoc tab gender if pt_dup!=1, missing
(File telesafe_results.doc already exists, option append was assumed)

           Gender |      Freq.     Percent        Cum.
------------------+-----------------------------------
             Male |         34       36.56       36.56
           Female |         59       63.44      100.00
------------------+-----------------------------------
            Total |         93      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab gender, missing
(File telesafe_results.doc already exists, option append was assumed)

           Gender |      Freq.     Percent        Cum.
------------------+-----------------------------------
             Male |         35       36.46       36.46
           Female |         61       63.54      100.00
------------------+-----------------------------------
            Total |         96      100.00
Click to Open File:  telesafe_results.doc

. 
. asdoc tab hcp_sex if one_per_gp==1
(File telesafe_results.doc already exists, option append was assumed)

       Sex of the |
       healthcare |
     professional |      Freq.     Percent        Cum.
------------------+-----------------------------------
             Male |          8       40.00       40.00
           Female |         12       60.00      100.00
------------------+-----------------------------------
            Total |         20      100.00
Click to Open File:  telesafe_results.doc

. 
. asdoc tab pt_age_cat if pt_dup!=1, missing
(File telesafe_results.doc already exists, option append was assumed)

   __000000 |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-34 |          9        9.68        9.68
      35-49 |          9        9.68       19.35
      50-64 |         21       22.58       41.94
       >=65 |         53       56.99       98.92
          . |          1        1.08      100.00
------------+-----------------------------------
      Total |         93      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab pt_age_cat, missing
(File telesafe_results.doc already exists, option append was assumed)

   __000000 |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-34 |          9        9.38        9.38
      35-49 |          9        9.38       18.75
      50-64 |         22       22.92       41.67
       >=65 |         55       57.29       98.96
          . |          1        1.04      100.00
------------+-----------------------------------
      Total |         96      100.00
Click to Open File:  telesafe_results.doc

. 
. asdoc tab gp_age_cat if one_per_gp==1
(File telesafe_results.doc already exists, option append was assumed)

   __000000 |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-34 |          2       10.00       10.00
      35-49 |         13       65.00       75.00
      50-64 |          5       25.00      100.00
------------+-----------------------------------
      Total |         20      100.00
Click to Open File:  telesafe_results.doc

. 
. asdoc tab ethnicity if pt_dup!=1, missing
(File telesafe_results.doc already exists, option append was assumed)

        Ethnicity |      Freq.     Percent        Cum.
------------------+-----------------------------------
            Black |          1        1.08        1.08
            Mixed |          2        2.15        3.23
            White |         87       93.55       96.77
Prefer not to say |          1        1.08       97.85
                . |          2        2.15      100.00
------------------+-----------------------------------
            Total |         93      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab ethnicity, missing
(File telesafe_results.doc already exists, option append was assumed)

        Ethnicity |      Freq.     Percent        Cum.
------------------+-----------------------------------
            Black |          1        1.04        1.04
            Mixed |          2        2.08        3.12
            White |         90       93.75       96.88
Prefer not to say |          1        1.04       97.92
                . |          2        2.08      100.00
------------------+-----------------------------------
            Total |         96      100.00
Click to Open File:  telesafe_results.doc

. 
. asdoc tab hcp_ethnicity if one_per_gp==1
(File telesafe_results.doc already exists, option append was assumed)

     HCP-reported |
        ethnicity |      Freq.     Percent        Cum.
------------------+-----------------------------------
            Asian |          2       10.00       10.00
            Mixed |          1        5.00       15.00
            White |         17       85.00      100.00
------------------+-----------------------------------
            Total |         20      100.00
Click to Open File:  telesafe_results.doc

. 
. asdoc tab hcp_role 
(File telesafe_results.doc already exists, option append was assumed)

  Healthcare professional |
                     role |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
A partner in your surgery |         86       89.58       89.58
            A salaried GP |          9        9.38       98.96
             GP Registrar |          1        1.04      100.00
--------------------------+-----------------------------------
                    Total |         96      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab hcp_role if one_per_gp==1
(File telesafe_results.doc already exists, option append was assumed)

  Healthcare professional |
                     role |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
A partner in your surgery |         14       70.00       70.00
            A salaried GP |          5       25.00       95.00
             GP Registrar |          1        5.00      100.00
--------------------------+-----------------------------------
                    Total |         20      100.00
Click to Open File:  telesafe_results.doc

. 
. asdoc tab no_of_probs, missing
(File telesafe_results.doc already exists, option append was assumed)

no_of_probs |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         53       55.21       55.21
          2 |         22       22.92       78.12
          3 |         17       17.71       95.83
          4 |          2        2.08       97.92
          5 |          2        2.08      100.00
------------+-----------------------------------
      Total |         96      100.00
Click to Open File:  telesafe_results.doc

. *1 is most deprived, 10 is least
. asdoc tab practice_dep, missing
(File telesafe_results.doc already exists, option append was assumed)

practice_de |
          p |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         20       20.83       20.83
          2 |          7        7.29       28.12
          5 |          6        6.25       34.38
          9 |         42       43.75       78.12
         10 |         21       21.88      100.00
------------+-----------------------------------
      Total |         96      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab practice_, missing nolab
(File telesafe_results.doc already exists, option append was assumed)

   practice |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          5        5.21        5.21
          2 |         42       43.75       48.96
          3 |          1        1.04       50.00
          4 |         21       21.88       71.88
          5 |          7        7.29       79.17
          6 |         15       15.62       94.79
          7 |          5        5.21      100.00
------------+-----------------------------------
      Total |         96      100.00
Click to Open File:  telesafe_results.doc

. 
. *Resullts P1 demographics
. tab gp_id2, matcell(gp_cons_freq)

      gp_id |      Freq.     Percent        Cum.
------------+-----------------------------------
       GP 1 |         18       18.75       18.75
       GP 2 |          1        1.04       19.79
       GP 3 |          1        1.04       20.83
       GP 4 |          6        6.25       27.08
       GP 5 |          3        3.12       30.21
       GP 6 |          1        1.04       31.25
       GP 7 |          1        1.04       32.29
       GP 8 |         20       20.83       53.12
       GP 9 |          3        3.12       56.25
      GP 10 |          2        2.08       58.33
      GP 11 |          9        9.38       67.71
      GP 12 |          2        2.08       69.79
      GP 13 |          1        1.04       70.83
      GP 14 |          5        5.21       76.04
      GP 15 |          1        1.04       77.08
      GP 16 |          5        5.21       82.29
      GP 17 |          4        4.17       86.46
      GP 18 |         11       11.46       97.92
      GP 19 |          1        1.04       98.96
      GP 20 |          1        1.04      100.00
------------+-----------------------------------
      Total |         96      100.00

. svmat gp_cons_freq, name(gp_cons_freq)

. asdoc tabstat gp_cons_freq, stat(mean median sd min max range) 
(File telesafe_results.doc already exists, option append was assumed)

             |      Mean        p50         SD        Min        Max      Range 
-------------+-----------------------------------------------------------------
gp_cons_fr~1 |       4.8        2.5   5.625132          1         20         19 
Click to Open File:  telesafe_results.doc

. 
. *Results P2 patient demographics
. asdoc tabstat pt_age, stat(mean median sd min max range) if pt_dup!=1
(File telesafe_results.doc already exists, option append was assumed)

             |      Mean        p50         SD        Min        Max      Range 
-------------+-----------------------------------------------------------------
      pt_age |  63.65263         69    16.3595         18         94         76 
Click to Open File:  telesafe_results.doc

. asdoc tabstat no_of_probs, stat(mean median sd min max range) 
(File telesafe_results.doc already exists, option append was assumed)

             |      Mean        p50         SD        Min        Max      Range 
-------------+-----------------------------------------------------------------
 no_of_probs |  1.729167          1   .9676794          1          5          4 
Click to Open File:  telesafe_results.doc

. 
. *Results P3 safety-netting per consultations
. asdoc tab any_sna_cons
(File telesafe_results.doc already exists, option append was assumed)

any_sna_con |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         38       39.58       39.58
          1 |         58       60.42      100.00
------------+-----------------------------------
      Total |         96      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab any_fu_cons
(File telesafe_results.doc already exists, option append was assumed)

any_fu_cons |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         22       22.92       22.92
          1 |         74       77.08      100.00
------------+-----------------------------------
      Total |         96      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab sna_and_fu_cons
(File telesafe_results.doc already exists, option append was assumed)

sna_and_fu_ |
       cons |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          4        4.17        4.17
          1 |         52       54.17       58.33
          2 |         40       41.67      100.00
------------+-----------------------------------
      Total |         96      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab any_sna_cons any_fu_cons
(File telesafe_results.doc already exists, option append was assumed)

any_sna_co |      any_fu_cons
        ns |         0          1 |     Total
-----------+----------------------+----------
         0 |         4         34 |        38 
         1 |        18         40 |        58 
-----------+----------------------+----------
     Total |        22         74 |        96 
Click to Open File:  telesafe_results.doc

. 
. **** Prob level**********************************************
. use  one_line_per_problem.dta, clear

. 
. ***Results P4*** safety-netting per problem
. asdoc tab any_sna_or_fu
(File telesafe_results.doc already exists, option append was assumed)

any_sna_or_ |
         fu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         27       16.27       16.27
          1 |        139       83.73      100.00
------------+-----------------------------------
      Total |        166      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab sna_and_fu
(File telesafe_results.doc already exists, option append was assumed)

 sna_and_fu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         27       16.27       16.27
          1 |         99       59.64       75.90
          2 |         40       24.10      100.00
------------+-----------------------------------
      Total |        166      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab any_fu
(File telesafe_results.doc already exists, option append was assumed)

           any_fu |      Freq.     Percent        Cum.
------------------+-----------------------------------
     No follow up |         59       35.54       35.54
Follow up present |        107       64.46      100.00
------------------+-----------------------------------
            Total |        166      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab any_sna
(File telesafe_results.doc already exists, option append was assumed)

    any_sna |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         94       56.63       56.63
          1 |         72       43.37      100.00
------------+-----------------------------------
      Total |        166      100.00
Click to Open File:  telesafe_results.doc

. 
. *Results Table 2*
. asdoc tab icpc3_cat_long
(File telesafe_results.doc already exists, option append was assumed)

                               __000000 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                            A - General |         31       18.67       18.67
B - Blood, blood-forming organs and imm |          4        2.41       21.08
                   D - Digestive system |         17       10.24       31.33
                                F - Eye |          2        1.20       32.53
                     G - Genital system |         17       10.24       42.77
                                H - Ear |          2        1.20       43.98
                 K - Circulatory system |         16        9.64       53.61
             L - Musculoskeletal system |         19       11.45       65.06
                N - Neurological system |          6        3.61       68.67
P - Psychological, mental and neurodeve |          7        4.22       72.89
                 R - Respiratory system |          7        4.22       77.11
                               S - Skin |         13        7.83       84.94
T - Endocrine, metabolic and nutritiona |         13        7.83       92.77
                     U - Urinary system |          9        5.42       98.19
         W - Pregnancy and childbearing |          2        1.20       99.40
                    Z - Social problems |          1        0.60      100.00
----------------------------------------+-----------------------------------
                                  Total |        166      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab icpc3_cat_long any_fu
(File telesafe_results.doc already exists, option append was assumed)

                      |        any_fu
             __000000 | No follow  Follow up |     Total
----------------------+----------------------+----------
          A - General |        11         20 |        31 
B - Blood, blood-form |         1          3 |         4 
 D - Digestive system |         8          9 |        17 
              F - Eye |         2          0 |         2 
   G - Genital system |         4         13 |        17 
              H - Ear |         2          0 |         2 
K - Circulatory syste |         2         14 |        16 
L - Musculoskeletal s |         4         15 |        19 
N - Neurological syst |         2          4 |         6 
P - Psychological, me |         4          3 |         7 
R - Respiratory syste |         4          3 |         7 
             S - Skin |         6          7 |        13 
T - Endocrine, metabo |         4          9 |        13 
   U - Urinary system |         2          7 |         9 
W - Pregnancy and chi |         2          0 |         2 
  Z - Social problems |         1          0 |         1 
----------------------+----------------------+----------
                Total |        59        107 |       166 
Click to Open File:  telesafe_results.doc

. asdoc tab icpc3_cat_long any_sna
(File telesafe_results.doc already exists, option append was assumed)

                      |        any_sna
             __000000 |         0          1 |     Total
----------------------+----------------------+----------
          A - General |        18         13 |        31 
B - Blood, blood-form |         2          2 |         4 
 D - Digestive system |        13          4 |        17 
              F - Eye |         1          1 |         2 
   G - Genital system |         9          8 |        17 
              H - Ear |         1          1 |         2 
K - Circulatory syste |         7          9 |        16 
L - Musculoskeletal s |        10          9 |        19 
N - Neurological syst |         3          3 |         6 
P - Psychological, me |         3          4 |         7 
R - Respiratory syste |         2          5 |         7 
             S - Skin |         8          5 |        13 
T - Endocrine, metabo |         9          4 |        13 
   U - Urinary system |         6          3 |         9 
W - Pregnancy and chi |         1          1 |         2 
  Z - Social problems |         1          0 |         1 
----------------------+----------------------+----------
                Total |        94         72 |       166 
Click to Open File:  telesafe_results.doc

. asdoc tab icpc3_cat_long any_sna_or_fu
(File telesafe_results.doc already exists, option append was assumed)

                      |     any_sna_or_fu
             __000000 |         0          1 |     Total
----------------------+----------------------+----------
          A - General |         6         25 |        31 
B - Blood, blood-form |         0          4 |         4 
 D - Digestive system |         6         11 |        17 
              F - Eye |         1          1 |         2 
   G - Genital system |         1         16 |        17 
              H - Ear |         1          1 |         2 
K - Circulatory syste |         1         15 |        16 
L - Musculoskeletal s |         1         18 |        19 
N - Neurological syst |         0          6 |         6 
P - Psychological, me |         1          6 |         7 
R - Respiratory syste |         1          6 |         7 
             S - Skin |         3         10 |        13 
T - Endocrine, metabo |         2         11 |        13 
   U - Urinary system |         1          8 |         9 
W - Pregnancy and chi |         1          1 |         2 
  Z - Social problems |         1          0 |         1 
----------------------+----------------------+----------
                Total |        27        139 |       166 
Click to Open File:  telesafe_results.doc

. *additional*
. asdoc tab icpc3_update_full if icpc3_cat =="A"
(File telesafe_results.doc already exists, option append was assumed)

                      icpc3_update_full |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                 A310 Polypharmacy care |          3        9.68        9.68
A310 Polypharmacy care - within discuss |          1        3.23       12.90
                   AD24.05 Lyme disease |          1        3.23       16.13
AD36 Other specified and unknown trauma |          1        3.23       19.35
        AD37 Secondary effect of trauma |          2        6.45       25.81
   AD41 Adverse effect of medical agent |          3        9.68       35.48
  AD43 Side-effect of prosthetic device |          1        3.23       38.71
AD44 Toxic effect of non-medicinal subs |          1        3.23       41.94
        AF03 Intrauterine contraception |          1        3.23       45.16
AF03 Intrauterine contraception or ?GS0 |          1        3.23       48.39
AG02 Other specified general examinatio |          1        3.23       51.61
AG04 Routine general health check-up of |          1        3.23       54.84
AP16 Special screening examination for  |          4       12.90       67.74
    AS01 General pain in multiple sites |          1        3.23       70.97
     AS04 General weakness or tiredness |          2        6.45       77.42
                 AS05 Postviral fatigue |          1        3.23       80.65
       AS05.00 Chronic fatigue syndrome |          1        3.23       83.87
 AS11 Bleeding (site unknown from call) |          1        3.23       87.10
AS50 Other specified abnormal result in |          2        6.45       93.55
AS50 Other specified abnormal result in |          1        3.23       96.77
AS50.00 Elevated blood glucose level (p |          1        3.23      100.00
----------------------------------------+-----------------------------------
                                  Total |         31      100.00
Click to Open File:  telesafe_results.doc

. 
. 
. ************* Factors associated with safety-netting advice Table 3 and Results Paragraph 5 & 6
. 
. * Acuity
. asdoc tab acuity_ any_sna, row 
(File telesafe_results.doc already exists, option append was assumed)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        any_sna
               acuity |         0          1 |     Total
----------------------+----------------------+----------
              Chronic |        51         31 |        82 
                      |     62.20      37.80 |    100.00 
----------------------+----------------------+----------
Acute / Acute on Chro |        43         41 |        84 
                      |     51.19      48.81 |    100.00 
----------------------+----------------------+----------
                Total |        94         72 |       166 
                      |     56.63      43.37 |    100.00 
Click to Open File:  telesafe_results.doc

. quietly xi: melogit any_sna i.acuity_ || practice_id: || gp_id2: ||consent_id:, or

. asdoc reformat, output(necp) dpp(3) eform dpcoef(2) append cw(35)

MEGLM formatted output

Outcome variable: any_sna , n=166
-----------------------------------------------------------------------------------------
Covariate                                   N  exp(coef.)    95% Conf. Interval     P>|z|
-----------------------------------------------------------------------------------------
Acuity                                                                           
  Chronic*                                 82           1                                
  Acute / Acute on Chronic                 84        2.67        (0.95 to 7.55)     0.063
-----------------------------------------------------------------------------------------
* Baseline category
Click to Open File:  telesafe_results.doc

. 
. * First presentation
. asdoc tab first_pres_ any_sna, row
(File telesafe_results.doc already exists, option append was assumed)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |        any_sna
           first_pres |         0          1 |     Total
----------------------+----------------------+----------
0 = No (not first pre |        71         56 |       127 
                      |     55.91      44.09 |    100.00 
----------------------+----------------------+----------
1 = Yes (first presen |        16         13 |        29 
                      |     55.17      44.83 |    100.00 
----------------------+----------------------+----------
         88 = unclear |         7          3 |        10 
                      |     70.00      30.00 |    100.00 
----------------------+----------------------+----------
                Total |        94         72 |       166 
                      |     56.63      43.37 |    100.00 
Click to Open File:  telesafe_results.doc

. quietly xi: melogit any_sna i.first_pres_ || practice_id: || gp_id2: || consent_id:, or

. asdoc reformat, output(necp) dpp(3) eform dpcoef(2) append cw(35)

MEGLM formatted output

Outcome variable: any_sna , n=166
-----------------------------------------------------------------------------------------
Covariate                                   N  exp(coef.)    95% Conf. Interval     P>|z|
-----------------------------------------------------------------------------------------
First_pres                                                                       
  0 = No (not first presentation to HCP)*       127           1                                
  1 = Yes (first presentation to HCP)        29        1.46        (0.45 to 4.77)     0.527
  88 = unclear                             10        0.38        (0.06 to 2.45)     0.307
-----------------------------------------------------------------------------------------
* Baseline category
Click to Open File:  telesafe_results.doc

. 
. *prob order
. asdoc tab prob_no any_sna, row
(File telesafe_results.doc already exists, option append was assumed)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |        any_sna
   prob_no |         0          1 |     Total
-----------+----------------------+----------
         1 |        47         49 |        96 
           |     48.96      51.04 |    100.00 
-----------+----------------------+----------
         2 |        26         17 |        43 
           |     60.47      39.53 |    100.00 
-----------+----------------------+----------
         3 |        16          5 |        21 
           |     76.19      23.81 |    100.00 
-----------+----------------------+----------
         4 |         3          1 |         4 
           |     75.00      25.00 |    100.00 
-----------+----------------------+----------
         5 |         2          0 |         2 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
     Total |        94         72 |       166 
           |     56.63      43.37 |    100.00 
Click to Open File:  telesafe_results.doc

. quietly xi: melogit any_sna prob_no || practice_id: || gp_id2: || consent_id:, or

. asdoc reformat, output(necp) dpp(3) eform dpcoef(2) append cw(35)

MEGLM formatted output

Outcome variable: any_sna , n=166
-----------------------------------------------------------------------------------------
Covariate                                   N  exp(coef.)    95% Conf. Interval     P>|z|
-----------------------------------------------------------------------------------------
Prob_no                                                                          
  per unit                                166        0.54        (0.33 to 0.91)     0.020
-----------------------------------------------------------------------------------------
Click to Open File:  telesafe_results.doc

. 
. * Any follow-up
. asdoc tab any_fu any_sna, row
(File telesafe_results.doc already exists, option append was assumed)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                  |        any_sna
           any_fu |         0          1 |     Total
------------------+----------------------+----------
     No follow up |        27         32 |        59 
                  |     45.76      54.24 |    100.00 
------------------+----------------------+----------
Follow up present |        67         40 |       107 
                  |     62.62      37.38 |    100.00 
------------------+----------------------+----------
            Total |        94         72 |       166 
                  |     56.63      43.37 |    100.00 
Click to Open File:  telesafe_results.doc

. quietly xi: melogit any_sna i.any_fu || practice_id: || gp_id2: || consent_id:, or

. asdoc reformat, output(necp) dpp(3) eform dpcoef(2) append cw(35)

MEGLM formatted output

Outcome variable: any_sna , n=166
-----------------------------------------------------------------------------------------
Covariate                                   N  exp(coef.)    95% Conf. Interval     P>|z|
-----------------------------------------------------------------------------------------
Any_fu                                                                           
  No follow up*                            59           1                                
  Follow up present                       107        0.49        (0.21 to 1.14)     0.097
-----------------------------------------------------------------------------------------
* Baseline category
Click to Open File:  telesafe_results.doc

. 
. * GP age45
. asdoc tab gp_age_45 any_sna, row
(File telesafe_results.doc already exists, option append was assumed)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

            |        any_sna
  gp_age_45 |         0          1 |     Total
------------+----------------------+----------
GP age >=45 |        59         32 |        91 
            |     64.84      35.16 |    100.00 
------------+----------------------+----------
 GP age <45 |        35         40 |        75 
            |     46.67      53.33 |    100.00 
------------+----------------------+----------
      Total |        94         72 |       166 
            |     56.63      43.37 |    100.00 
Click to Open File:  telesafe_results.doc

. quietly xi: melogit any_sna i.gp_age_45 || practice_id: || gp_id2: || consent_id:, or base

. asdoc reformat, output(necp) dpp(3) eform dpcoef(2) append cw(35)

MEGLM formatted output

Outcome variable: any_sna , n=166
-----------------------------------------------------------------------------------------
Covariate                                   N  exp(coef.)    95% Conf. Interval     P>|z|
-----------------------------------------------------------------------------------------
Gp_age_45                                                                        
  GP age >=45*                             91           1                                
  GP age <45                               75        3.56       (1.11 to 11.39)     0.033
-----------------------------------------------------------------------------------------
* Baseline category
Click to Open File:  telesafe_results.doc

. 
. * Patient age ≥ 65
. asdoc tab pt_age_65 any_sna, row
(File telesafe_results.doc already exists, option append was assumed)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                 |        any_sna
       pt_age_65 |         0          1 |     Total
-----------------+----------------------+----------
 Patient age <65 |        39         32 |        71 
                 |     54.93      45.07 |    100.00 
-----------------+----------------------+----------
Patient age >=65 |        55         39 |        94 
                 |     58.51      41.49 |    100.00 
-----------------+----------------------+----------
           Total |        94         71 |       165 
                 |     56.97      43.03 |    100.00 
Click to Open File:  telesafe_results.doc

. quietly xi: melogit any_sna i.pt_age_65 || practice_id: || gp_id2: || consent_id:, or

. asdoc reformat, output(necp) dpp(3) eform dpcoef(2) append cw(35)

MEGLM formatted output

Outcome variable: any_sna , n=165
-----------------------------------------------------------------------------------------
Covariate                                   N  exp(coef.)    95% Conf. Interval     P>|z|
-----------------------------------------------------------------------------------------
Pt_age_65                                                                        
  Patient age <65*                         71           1                                
  Patient age >=65                         94        0.63        (0.21 to 1.88)     0.405
-----------------------------------------------------------------------------------------
* Baseline category
Click to Open File:  telesafe_results.doc

. 
. * Patient gender
. asdoc tab pt_gender any_sna, row
(File telesafe_results.doc already exists, option append was assumed)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                  |        any_sna
           Gender |         0          1 |     Total
------------------+----------------------+----------
             Male |        34         22 |        56 
                  |     60.71      39.29 |    100.00 
------------------+----------------------+----------
           Female |        60         50 |       110 
                  |     54.55      45.45 |    100.00 
------------------+----------------------+----------
            Total |        94         72 |       166 
                  |     56.63      43.37 |    100.00 
Click to Open File:  telesafe_results.doc

. quietly xi: melogit any_sna i.pt_gender || practice_id: || gp_id2: || consent_id:, or

. asdoc reformat, output(necp) dpp(3) eform dpcoef(2) append cw(35)

MEGLM formatted output

Outcome variable: any_sna , n=166
-----------------------------------------------------------------------------------------
Covariate                                   N  exp(coef.)    95% Conf. Interval     P>|z|
-----------------------------------------------------------------------------------------
Gender                                                                           
  Male*                                    56           1                                
  Female                                  110        1.60        (0.55 to 4.66)     0.389
-----------------------------------------------------------------------------------------
* Baseline category
Click to Open File:  telesafe_results.doc

. 
. * Practice dep cat
. asdoc tab practice_dep_cat_ any_sna, row
(File telesafe_results.doc already exists, option append was assumed)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                  |        any_sna
practice_dep_cat_ |         0          1 |     Total
------------------+----------------------+----------
Affluent IMD=9-10 |        60         40 |       100 
                  |     60.00      40.00 |    100.00 
------------------+----------------------+----------
 Deprived IMD=1-2 |        31         26 |        57 
                  |     54.39      45.61 |    100.00 
------------------+----------------------+----------
     Middle IMD=5 |         3          6 |         9 
                  |     33.33      66.67 |    100.00 
------------------+----------------------+----------
            Total |        94         72 |       166 
                  |     56.63      43.37 |    100.00 
Click to Open File:  telesafe_results.doc

. quietly xi: melogit any_sna i.practice_dep_cat_ || practice_id: || gp_id2: || consent_id:, or

. asdoc reformat, output(necp) dpp(3) eform dpcoef(2) append cw(35)

MEGLM formatted output

Outcome variable: any_sna , n=166
-----------------------------------------------------------------------------------------
Covariate                                   N  exp(coef.)    95% Conf. Interval     P>|z|
-----------------------------------------------------------------------------------------
Practice_dep_cat_                                                                
  Affluent IMD=9-10*                      100           1                                
  Deprived IMD=1-2                         57        1.46        (0.43 to 4.95)     0.541
  Middle IMD=5                              9        4.62       (0.49 to 43.46)     0.181
-----------------------------------------------------------------------------------------
* Baseline category
Click to Open File:  telesafe_results.doc

. 
. ** multivariable 
. quietly xi: melogit any_sna i.acuity_ i.first_pres_ prob_no i.any_fu i.gp_age_45 i.pt_age_65 i.pt_gender i.practice_dep_cat_ || practice_id: || gp_id2: || consent_id:, base or

. asdoc reformat, output(necp) dpp(3) eform dpcoef(2) append cw(45)

MEGLM formatted output

Outcome variable: any_sna , n=165
---------------------------------------------------------------------------------------------------
Covariate                                             N  exp(coef.)    95% Conf. Interval     P>|z|
---------------------------------------------------------------------------------------------------
Acuity                                                                                     
  Chronic*                                           82           1                                
  Acute / Acute on Chronic                           83        1.69        (0.57 to 5.02)     0.344
First_pres                                                                                 
  0 = No (not first presentation to HCP)*           126           1                                
  1 = Yes (first presentation to HCP)                29        1.18        (0.34 to 4.07)     0.792
  88 = unclear                                       10        0.38        (0.05 to 2.80)     0.345
Prob_no                                                                                    
  per unit                                          165        0.60        (0.35 to 1.04)     0.067
Any_fu                                                                                     
  No follow up*                                      59           1                                
  Follow up present                                 106        0.62        (0.25 to 1.55)     0.306
Gp_age_45                                                                                  
  GP age >=45*                                       91           1                                
  GP age <45                                         74        5.09       (1.45 to 17.89)     0.011
Pt_age_65                                                                                  
  Patient age <65*                                   71           1                                
  Patient age >=65                                   94        0.98        (0.33 to 2.93)     0.975
Gender                                                                                     
  Male*                                              55           1                                
  Female                                            110        1.39        (0.47 to 4.11)     0.550
Practice_dep_cat_                                                                          
  Affluent IMD=9-10*                                 99           1                                
  Deprived IMD=1-2                                   57        3.37       (0.93 to 12.25)     0.065
  Middle IMD=5                                        9        9.50      (0.86 to 105.35)     0.067
---------------------------------------------------------------------------------------------------
* Baseline category
Click to Open File:  telesafe_results.doc

. 
. 
. *** safety-netting episode level**
. use telesafe_sancot.dta, clear

. 
. *Results P7 and table 4 Content of safety-netting advice
. asdoc tab sna_single_or_multiple_probs
(File telesafe_results.doc already exists, option append was assumed)

sna_single_or_multiple |
                _probs |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
1 = This problem only  |         84       90.32       90.32
 2 = Multiple Problems |          9        9.68      100.00
-----------------------+-----------------------------------
                 Total |         93      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab sna_applies
(File telesafe_results.doc already exists, option append was assumed)

                            sna_applies |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                            1 = Problem |         62       66.67       66.67
        2 = Treatment / Management Plan |         17       18.28       84.95
3 = Both (often if vague but can be mix |         14       15.05      100.00
----------------------------------------+-----------------------------------
                                  Total |         93      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab sna_stage
(File telesafe_results.doc already exists, option append was assumed)

                sna_stage |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
2 = Gathering Information |          2        2.15        2.15
 3 = Delivering Diagnoses |          8        8.60       10.75
   4 = Treatment Planning |         62       66.67       77.42
              5 = Closing |         19       20.43       97.85
        post consultation |          2        2.15      100.00
--------------------------+-----------------------------------
                    Total |         93      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab sna_init
(File telesafe_results.doc already exists, option append was assumed)

     sna_init |      Freq.     Percent        Cum.
--------------+-----------------------------------
1 = Clinician |         89       95.70       95.70
  2 = Patient |          4        4.30      100.00
--------------+-----------------------------------
        Total |         93      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab sna_format
(File telesafe_results.doc already exists, option append was assumed)

                        sna_format |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
             0 = Conditional Only  |          6        6.45        6.45
1 = Conditional + Course of Action |         87       93.55      100.00
-----------------------------------+-----------------------------------
                             Total |         93      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab sna_strength
(File telesafe_results.doc already exists, option append was assumed)

                           sna_strength |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                0 = Weaker (can, could) |         24       25.81       25.81
                            1 = Neutral |         47       50.54       76.34
2 = Stronger (must, should, need to, th |         22       23.66      100.00
----------------------------------------+-----------------------------------
                                  Total |         93      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab sna_conditionals
(File telesafe_results.doc already exists, option append was assumed)

sna_conditi |
      onals |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         60       64.52       64.52
          2 |         17       18.28       82.80
          3 |          5        5.38       88.17
          4 |          1        1.08       89.25
          5 |          3        3.23       92.47
          6 |          5        5.38       97.85
         11 |          1        1.08       98.92
         13 |          1        1.08      100.00
------------+-----------------------------------
      Total |         93      100.00
Click to Open File:  telesafe_results.doc

. *asdoc tab sna_conditions_text - not for publication
. asdoc tabstat sna_conditionals, stat(mean median sd min max range) 
(File telesafe_results.doc already exists, option append was assumed)

             |      Mean        p50         SD        Min        Max      Range 
-------------+-----------------------------------------------------------------
sna_condit~s |  1.956989          1    2.02653          1         13         12 
Click to Open File:  telesafe_results.doc

. asdoc tab sna_specific
(File telesafe_results.doc already exists, option append was assumed)

     sna_specific |      Freq.     Percent        Cum.
------------------+-----------------------------------
      0 = Generic |         33       35.48       35.48
          1 = G&S |         15       16.13       51.61
2 = Specific only |         45       48.39      100.00
------------------+-----------------------------------
            Total |         93      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab sna_action
(File telesafe_results.doc already exists, option append was assumed)

                             sna_action |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                  0 = No action advised |          6        6.45        6.45
1 = Other IN HOURS HCP (not based at pr |          2        2.15        8.60
       2 = Return to / contact practice |         50       53.76       62.37
                 3 = Return to same HCP |         22       23.66       86.02
              4 = Contact OOH / NHS 111 |          1        1.08       87.10
5 = Contact emergency services e.g. 999 |          7        7.53       94.62
                           6 = multiple |          2        2.15       96.77
               unspecified medical help |          3        3.23      100.00
----------------------------------------+-----------------------------------
                                  Total |         93      100.00
Click to Open File:  telesafe_results.doc

. list actions if sna_action == "6 = multiple"

     +----------------------------------+
     |                          actions |
     |----------------------------------|
 52. |                          gp, 111 |
159. | give them a call or call us back |
     +----------------------------------+

. list consent_id if sna_action == "6 = multiple"

 REDACTED - confirm 2 cases

. asdoc tab sna_action_focus
(File telesafe_results.doc already exists, option append was assumed)

              sna_action_focus |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
                 1 = Clinician |         29       31.18       31.18
                   2 = Patient |         34       36.56       67.74
  3 = Both Clinician & Patient |         24       25.81       93.55
99 = N/A - no action component |          6        6.45      100.00
-------------------------------+-----------------------------------
                         Total |         93      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab sna_timescale
(File telesafe_results.doc already exists, option append was assumed)

                    sna_timescale |      Freq.     Percent        Cum.
----------------------------------+-----------------------------------
                0 = Not specified |         60       64.52       64.52
1 = Named Day / fixed time period |         28       30.11       94.62
           2 = Immediate / Urgent |          5        5.38      100.00
----------------------------------+-----------------------------------
                            Total |         93      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab sna_pt_response
(File telesafe_results.doc already exists, option append was assumed)

                        sna_pt_response |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                        0 = No response |          8        8.60        8.60
      1 = Resists, aligns / misaligning |         24       25.81       34.41
3 = Acknowledgement (yeah, right, umm), |         60       64.52       98.92
                               CBD text |          1        1.08      100.00
----------------------------------------+-----------------------------------
                                  Total |         93      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab sna_questions
(File telesafe_results.doc already exists, option append was assumed)

                          sna_questions |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 0 = no questions asked about SN advice |         85       91.40       91.40
1 = patient asks a question about SN ad |          8        8.60      100.00
----------------------------------------+-----------------------------------
                                  Total |         93      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab sna_coms
(File telesafe_results.doc already exists, option append was assumed)

              sna_coms |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
       1 = Verbal only |         88       94.62       94.62
2 = Verbal and written |          3        3.23       97.85
           3 = unclear |          1        1.08       98.92
          written only |          1        1.08      100.00
-----------------------+-----------------------------------
                 Total |         93      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab sna_coms if extra_append==0
(File telesafe_results.doc already exists, option append was assumed)

              sna_coms |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
       1 = Verbal only |         61       92.42       92.42
2 = Verbal and written |          3        4.55       96.97
           3 = unclear |          1        1.52       98.48
          written only |          1        1.52      100.00
-----------------------+-----------------------------------
                 Total |         66      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab sna_doc if extra_append==0
(File telesafe_results.doc already exists, option append was assumed)

                         sna_doc |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
     0 = No documentation of SNA |         28       38.36       38.36
1 = Documentation of SNA present |         39       53.42       91.78
          88 = CBD as NO RECORDS |          5        6.85       98.63
               doc but no verbal |          1        1.37      100.00
---------------------------------+-----------------------------------
                           Total |         73      100.00
Click to Open File:  telesafe_results.doc

. *
. asdoc tab sna_stage sna_specific_bin
(File telesafe_results.doc already exists, option append was assumed)

                      |       __000001
            sna_stage |   generic   specific |     Total
----------------------+----------------------+----------
2 = Gathering Informa |         1          1 |         2 
3 = Delivering Diagno |         0          8 |         8 
4 = Treatment Plannin |        19         43 |        62 
          5 = Closing |        13          6 |        19 
    post consultation |         0          2 |         2 
----------------------+----------------------+----------
                Total |        33         60 |        93 
Click to Open File:  telesafe_results.doc

. 
. 
. ** Results P8 elivery of safety-netting advice
. use one_line_per_problem.dta, clear

. asdoc tab sna_coms
(File telesafe_results.doc already exists, option append was assumed)

              sna_coms |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
       1 = Verbal only |         67       93.06       93.06
2 = Verbal and written |          4        5.56       98.61
          written only |          1        1.39      100.00
-----------------------+-----------------------------------
                 Total |         72      100.00
Click to Open File:  telesafe_results.doc

. *5 written problems but 2 from same consultation
. 
. * Results P9 symptoms to look out for
. use telesafe_sancot.dta, clear

. asdoc tab sna_conditionals
(File telesafe_results.doc already exists, option append was assumed)

sna_conditi |
      onals |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         60       64.52       64.52
          2 |         17       18.28       82.80
          3 |          5        5.38       88.17
          4 |          1        1.08       89.25
          5 |          3        3.23       92.47
          6 |          5        5.38       97.85
         11 |          1        1.08       98.92
         13 |          1        1.08      100.00
------------+-----------------------------------
      Total |         93      100.00
Click to Open File:  telesafe_results.doc

. asdoc tabstat sna_conditionals, stat(mean median sd min max range) 
(File telesafe_results.doc already exists, option append was assumed)

             |      Mean        p50         SD        Min        Max      Range 
-------------+-----------------------------------------------------------------
sna_condit~s |  1.956989          1    2.02653          1         13         12 
Click to Open File:  telesafe_results.doc

. 
. use one_line_per_problem.dta, clear

. asdoc tab sna_conditionals_unique
(File telesafe_results.doc already exists, option append was assumed)

sna_conditi |
onals_uniqu |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         36       50.00       50.00
          2 |         13       18.06       68.06
          3 |          7        9.72       77.78
          4 |          3        4.17       81.94
          5 |          5        6.94       88.89
          6 |          4        5.56       94.44
          8 |          2        2.78       97.22
         11 |          1        1.39       98.61
         16 |          1        1.39      100.00
------------+-----------------------------------
      Total |         72      100.00
Click to Open File:  telesafe_results.doc

. asdoc tabstat sna_conditionals_unique, stat(mean median sd min max range) 
(File telesafe_results.doc already exists, option append was assumed)

             |      Mean        p50         SD        Min        Max      Range 
-------------+-----------------------------------------------------------------
sna_condit~e |  2.597222        1.5   2.619858          1         16         15 
Click to Open File:  telesafe_results.doc

. 
. *Table 5 
. use sna_conditionals.dta, clear

. tabstat new, stat(sum)

    Variable |       Sum
-------------+----------
         new |        83
------------------------

. tabstat persists_no_time, stat(sum)

    Variable |       Sum
-------------+----------
persists_n~e |        12
------------------------

. tabstat persists_with_time, stat(sum)

    Variable |       Sum
-------------+----------
persists_w~e |        24
------------------------

. tabstat other_ns, stat(sum)

    Variable |       Sum
-------------+----------
    other_ns |        18
------------------------

. tabstat worse, stat(sum)

    Variable |       Sum
-------------+----------
       worse |        14
------------------------

. tabstat symptoms_return, stat(sum)

    Variable |       Sum
-------------+----------
symptoms_r~n |         9
------------------------

. tabstat concern, stat(sum)

    Variable |       Sum
-------------+----------
     concern |         7
------------------------

. tabstat problem, stat(sum)

    Variable |       Sum
-------------+----------
     problem |         6
------------------------

. tabstat unwell, stat(sum)

    Variable |       Sum
-------------+----------
      unwell |         4
------------------------

. tabstat apt, stat(sum)

    Variable |       Sum
-------------+----------
         apt |         3
------------------------

. tabstat changes, stat(sum)

    Variable |       Sum
-------------+----------
     changes |         2
------------------------

. 
. drop sna_conditions_text total

. *per problem with SNA
. ds consent_id, not
consent_id2   sna_condit~s  new           persists_n~e  persists_w~e  worse         other_ns      problem       symptoms_r~n  concern       changes       unwell        apt

. collapse (sum) `r(varlist)', by(consent_id)

. foreach var of varlist new persists_no_time persists_with_time worse other_ns problem concern symptoms_return unwell changes apt {
  2.     replace `var' = 1 if `var' > 0 & `var' < .
  3. }
(17 real changes made)
(2 real changes made)
(6 real changes made)
(2 real changes made)
(4 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. asdoc tab new
(File telesafe_results.doc already exists, option append was assumed)

  (sum) new |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         31       53.45       53.45
          1 |         27       46.55      100.00
------------+-----------------------------------
      Total |         58      100.00
Click to Open File:  telesafe_results.doc

. replace persists_no_time = 0 if persists_with_time==1
(4 real changes made)

. gen persist = 1 if persists_no_time==1
(52 missing values generated)

. replace persist = 1 if persists_with_time==1
(17 real changes made)

. asdoc tab persist
(File telesafe_results.doc already exists, option append was assumed)

    persist |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         23      100.00      100.00
------------+-----------------------------------
      Total |         23      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab persists_no_time
(File telesafe_results.doc already exists, option append was assumed)

      (sum) |
persists_no |
      _time |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         52       89.66       89.66
          1 |          6       10.34      100.00
------------+-----------------------------------
      Total |         58      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab persists_with_time
(File telesafe_results.doc already exists, option append was assumed)

      (sum) |
persists_wi |
    th_time |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         41       70.69       70.69
          1 |         17       29.31      100.00
------------+-----------------------------------
      Total |         58      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab other_ns
(File telesafe_results.doc already exists, option append was assumed)

      (sum) |
   other_ns |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         44       75.86       75.86
          1 |         14       24.14      100.00
------------+-----------------------------------
      Total |         58      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab worse
(File telesafe_results.doc already exists, option append was assumed)

(sum) worse |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         46       79.31       79.31
          1 |         12       20.69      100.00
------------+-----------------------------------
      Total |         58      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab symptoms_return
(File telesafe_results.doc already exists, option append was assumed)

      (sum) |
symptoms_re |
       turn |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         54       93.10       93.10
          1 |          4        6.90      100.00
------------+-----------------------------------
      Total |         58      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab concern
(File telesafe_results.doc already exists, option append was assumed)

      (sum) |
    concern |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         51       87.93       87.93
          1 |          7       12.07      100.00
------------+-----------------------------------
      Total |         58      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab problem
(File telesafe_results.doc already exists, option append was assumed)

      (sum) |
    problem |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         52       89.66       89.66
          1 |          6       10.34      100.00
------------+-----------------------------------
      Total |         58      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab unwell
(File telesafe_results.doc already exists, option append was assumed)

      (sum) |
     unwell |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         54       93.10       93.10
          1 |          4        6.90      100.00
------------+-----------------------------------
      Total |         58      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab apt
(File telesafe_results.doc already exists, option append was assumed)

  (sum) apt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         55       94.83       94.83
          1 |          3        5.17      100.00
------------+-----------------------------------
      Total |         58      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab changes
(File telesafe_results.doc already exists, option append was assumed)

      (sum) |
    changes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         56       96.55       96.55
          1 |          2        3.45      100.00
------------+-----------------------------------
      Total |         58      100.00
Click to Open File:  telesafe_results.doc

. 
. ************documentation results p10
. 
. use one_line_per_cons.dta, clear

. asdoc tab sna_doc_cons if any_sna_cons ==1, missing
(File telesafe_results.doc already exists, option append was assumed)

                    sna_doc_cons |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
     0 = No documentation of SNA |         19       32.76       32.76
1 = Documentation of SNA present |         34       58.62       91.38
          88 = CBD as NO RECORDS |          5        8.62      100.00
---------------------------------+-----------------------------------
                           Total |         58      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab sna_doc_cons if any_sna_cons ==1 & sna_doc_cons!=3, missing
(File telesafe_results.doc already exists, option append was assumed)

                    sna_doc_cons |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
     0 = No documentation of SNA |         19       35.85       35.85
1 = Documentation of SNA present |         34       64.15      100.00
---------------------------------+-----------------------------------
                           Total |         53      100.00
Click to Open File:  telesafe_results.doc

. 
. use one_line_per_problem.dta, clear

. asdoc tab sna_doc if any_sna==1
(File telesafe_results.doc already exists, option append was assumed)

                         sna_doc |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
     0 = No documentation of SNA |         28       38.89       38.89
1 = Documentation of SNA present |         39       54.17       93.06
          88 = CBD as NO RECORDS |          5        6.94      100.00
---------------------------------+-----------------------------------
                           Total |         72      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab sna_doc if any_sna==1 & sna_doc !="88 = CBD as NO RECORDS"
(File telesafe_results.doc already exists, option append was assumed)

                         sna_doc |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
     0 = No documentation of SNA |         28       41.79       41.79
1 = Documentation of SNA present |         39       58.21      100.00
---------------------------------+-----------------------------------
                           Total |         67      100.00
Click to Open File:  telesafe_results.doc

. 
. ***** patient recall results p11***
. use one_line_per_cons.dta, clear

. tab  pt_safety_netting any_sna_cons, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

       Did HCP |
  explain what |
      to do if |     any_sna_cons
        worse? |         0          1 |     Total
---------------+----------------------+----------
           Yes |        13         38 |        51 
               |     37.14      69.09 |     56.67 
---------------+----------------------+----------
            No |        10          8 |        18 
               |     28.57      14.55 |     20.00 
---------------+----------------------+----------
      Not sure |         4          3 |         7 
               |     11.43       5.45 |      7.78 
---------------+----------------------+----------
Does not apply |         8          6 |        14 
               |     22.86      10.91 |     15.56 
---------------+----------------------+----------
         Total |        35         55 |        90 
               |    100.00     100.00 |    100.00 

. 
. 
. *** hcp survey results p11-13 and supplmentary table S1
. 
. use hcp_survey_data_from_all_data_manual_corrected.dta, clear
(OneInAMillionTELESAF_DATA_NOHDRS_2025-02-25_1406.csv)

. asdoc tab hcp_verbal_sna
(File telesafe_results.doc already exists, option append was assumed)

      Frequency of verbal |
    safety-netting advice |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
       Sometimes (25-49%) |          2        7.14        7.14
           Often (50-69%) |         12       42.86       50.00
Most of the time (70-89%) |          8       28.57       78.57
     Almost always (≥90%) |          6       21.43      100.00
--------------------------+-----------------------------------
                    Total |         28      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab hcp_verbal_sna if has_cons == 1
(File telesafe_results.doc already exists, option append was assumed)

      Frequency of verbal |
    safety-netting advice |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
       Sometimes (25-49%) |          1        5.00        5.00
           Often (50-69%) |         11       55.00       60.00
Most of the time (70-89%) |          6       30.00       90.00
     Almost always (≥90%) |          2       10.00      100.00
--------------------------+-----------------------------------
                    Total |         20      100.00
Click to Open File:  telesafe_results.doc

. 
. asdoc tab hcp_written_sna
(File telesafe_results.doc already exists, option append was assumed)

     Frequency of written |
    safety-netting advice |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
           Rarely (< 25%) |         12       42.86       42.86
       Sometimes (25-49%) |          8       28.57       71.43
           Often (50-69%) |          2        7.14       78.57
Most of the time (70-89%) |          3       10.71       89.29
     Almost always (≥90%) |          3       10.71      100.00
--------------------------+-----------------------------------
                    Total |         28      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab hcp_written_sna if has_cons == 1
(File telesafe_results.doc already exists, option append was assumed)

     Frequency of written |
    safety-netting advice |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
           Rarely (< 25%) |         10       50.00       50.00
       Sometimes (25-49%) |          7       35.00       85.00
           Often (50-69%) |          2       10.00       95.00
Most of the time (70-89%) |          1        5.00      100.00
--------------------------+-----------------------------------
                    Total |         20      100.00
Click to Open File:  telesafe_results.doc

. 
. asdoc tab hcp_sna_importance
(File telesafe_results.doc already exists, option append was assumed)

     SNA is important and |
    benefits patient care |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
Neither agree or disagree |          1        3.57        3.57
                    Agree |         12       42.86       46.43
           Strongly agree |         15       53.57      100.00
--------------------------+-----------------------------------
                    Total |         28      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab hcp_sna_importance if has_cons == 1
(File telesafe_results.doc already exists, option append was assumed)

     SNA is important and |
    benefits patient care |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
Neither agree or disagree |          1        5.00        5.00
                    Agree |         10       50.00       55.00
           Strongly agree |          9       45.00      100.00
--------------------------+-----------------------------------
                    Total |         20      100.00
Click to Open File:  telesafe_results.doc

. 
. asdoc tab hcp_sna_demand
(File telesafe_results.doc already exists, option append was assumed)

   SNA leads to increased |
           patient demand |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
        Strongly disagree |          2        7.14        7.14
                 Disagree |         11       39.29       46.43
Neither agree or disagree |         12       42.86       89.29
                    Agree |          3       10.71      100.00
--------------------------+-----------------------------------
                    Total |         28      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab hcp_sna_demand if has_cons == 1
(File telesafe_results.doc already exists, option append was assumed)

   SNA leads to increased |
           patient demand |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
        Strongly disagree |          1        5.00        5.00
                 Disagree |          9       45.00       50.00
Neither agree or disagree |          9       45.00       95.00
                    Agree |          1        5.00      100.00
--------------------------+-----------------------------------
                    Total |         20      100.00
Click to Open File:  telesafe_results.doc

. 
. asdoc tab hcp_sna_reason
(File telesafe_results.doc already exists, option append was assumed)

  Main reason for giving safety-netting |
                                 advice |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                           Patient care |          1        3.57        3.57
Mostly patient care some medico-legal c |         11       39.29       42.86
Equal patient care and medico-legal cov |         15       53.57       96.43
Mostly medico-legal cover some patient  |          1        3.57      100.00
----------------------------------------+-----------------------------------
                                  Total |         28      100.00
Click to Open File:  telesafe_results.doc

. asdoc tab hcp_sna_reason if has_cons == 1
(File telesafe_results.doc already exists, option append was assumed)

  Main reason for giving safety-netting |
                                 advice |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                           Patient care |          1        5.00        5.00
Mostly patient care some medico-legal c |          7       35.00       40.00
Equal patient care and medico-legal cov |         12       60.00      100.00
----------------------------------------+-----------------------------------
                                  Total |         20      100.00
Click to Open File:  telesafe_results.doc

. 
. log close
